// Форма поиска
// Создает DOM-элемент следующей структуры. Можно использовать шаблонизацию.

// <form class="search-form" id="search-form">
//   <input
//     type="text"
//     name="query"
//     autocomplete="off"
//     placeholder="Search images..."
//   />
// </form>

// Галерея изображений
// Создает DOM-элемент следующей структуры.
// <ul class="gallery">
//   <!-- Список <li> с карточками изображений -->
// </ul>

// Кнопка 'Load more'
// При нажатии на кнопку Load more должна догружаться следующая порция изображений и рендериться вместе с предыдущими.

// Страница должна автоматически плавно проскроливаться после рендера изображений, чтобы перевести пользователя на следующие загруженные изображения. Используй метод Element.scrollIntoView().

// const element = document.getElementById('.my-element-selector');
// element.scrollIntoView({
//   behavior: 'smooth',
//   block: 'end',
// });

// Дополнительно
// Можно добавить плагин нотификаций, например pnotify, и показывать нотификации на результат HTTP-запросов
// Можно добавить функционал отображения большой версии изображения через плагин модального окна, например basicLightbox, при клике на изображение галереи
// Вместо кнопки Load more можно сделать бесконечную загрузку при скроле используя Intersection Observer.